# Aula 3 - Numpy e Pandas

Nessa aula, iremos tratar dos seguintes conteúdos:
- Numpy Matrizes
- Métodos de Matrizes Numpy
- Pandas
- Series
- Métodos Pandas
- DataFrames
- Trabalhando com CSVs

<img src="" width=800>

Utilize comprehension para gerar a lista de todos os números pares entre 0 e 19. Converta a lista em um __numpy__ array e cálcule a média.

In [4]:
import numpy as np

numbers = [i for i in range(0, 20) if i % 2 == 0]
numbers_arr = np.array(numbers)
numbers_avg = np.mean(numbers_arr)
print('Os números são', numbers_arr)
print('A média é', numbers_avg)

Os números são [ 0  2  4  6  8 10 12 14 16 18]
A média é 9.0

## Matrizes - Arrays Bidimensionais

In [6]:
## Cria uma matriz usando o np.array
linha_1 = [0, 1, 2, 3]
linha_2 = [4, 5, 6, 7]
matriz = np.array([linha_1, linha_2])
print(matriz)

[[0 1 2 3]
 [4 5 6 7]]

In [10]:
## É possível fazer matrizes com as funções que já trabalhamos anteriormente

## zeros
matriz_zeros = np.zeros((5, 3)) ## X linhas por Y colunas
print("Matriz de zeros")
print(matriz_zeros)

print('\n')

## uns
matriz_uns = np.ones((5, 10))
print("Matriz de uns")
print(matriz_uns)

print('\n')

## identidade
matriz_identidade = np.identity(4)
print('Matriz identidade')
print(matriz_identidade)

Matriz de zeros
[[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]]


Matriz de uns
[[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]


Matriz identidade
[[1. 0. 0. 0.]
 [0. 1. 0. 0.]
 [0. 0. 1. 0.]
 [0. 0. 0. 1.]]

Numpy arrays são objetos chamados _ndarrays_ e possuem diversos atributos 
- ndarray.ndim - número de eixos (dimensões) do array
- ndarray.shape - uma tupla de inteiros indicando o tamanho do array em cada dimensão
- ndarray.size - o número total de elementos do array
- ndarray.dtype - tipo dos elementos no array
- ndarray.itemsize - o tamanho em bytes de cada elemento do array
- ndarray.data - o buffer de memória contendo os elementos do array

In [12]:
## Verifica o tipo
array = np.linspace(0, 2, 30)
print(type(array))

<class 'numpy.ndarray'>

In [20]:
## Vamos ver os atributos
print('Array:')
print(array)

print('\n')

print('ndim =', array.ndim)
print('shape =', array.shape)
print('size =', array.size)
print('dtype =', array.dtype)
print('itemsize =', array.itemsize)
print('data =',array.data )

matriz_identidade = np.identity(5)

print('Matriz:')
print(matriz_identidade)

print('\n')

print('ndim =', matriz_identidade.ndim)
print('shape =', matriz_identidade.shape)
print('size =', matriz_identidade.size)
print('dtype =', matriz_identidade.dtype)
print('itemsize =', matriz_identidade.itemsize)
print('data =',matriz_identidade.data )

Array:
[0.         0.06896552 0.13793103 0.20689655 0.27586207 0.34482759
 0.4137931  0.48275862 0.55172414 0.62068966 0.68965517 0.75862069
 0.82758621 0.89655172 0.96551724 1.03448276 1.10344828 1.17241379
 1.24137931 1.31034483 1.37931034 1.44827586 1.51724138 1.5862069
 1.65517241 1.72413793 1.79310345 1.86206897 1.93103448 2.        ]


ndim = 1
shape = (30,)
size = 30
dtype = float64
itemsize = 8
data = <memory at 0x00000225AB55BAC0>
Matriz:
[[1. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0.]
 [0. 0. 1. 0. 0.]
 [0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 1.]]


ndim = 2
shape = (5, 5)
size = 25
dtype = float64
itemsize = 8
data = <memory at 0x00000225950A8AD0>

## Métodos Numpy para matrizes

Vamos aprender agora alguns métodos muito úteis para serem aplicados em arrays, muitos desses métodos serão herdados pelo Pandas, então vão ter uma usabilidade bem grande:

__Método reshape:__  permite reformatar o array modificando o número de linhas e colunas, porém, a nova 'shape' tem que possuir o mesmo número de elementos do array original:

In [24]:
## reshape
arr1 = np.arange(9)
print('array original')
print(arr1)

print('\n')

arr_reshape = arr1.reshape((3,3))
print('array reshape')
print(arr_reshape)

array original
[0 1 2 3 4 5 6 7 8]


array reshape
[[0 1 2]
 [3 4 5]
 [6 7 8]]

__Método ravel:__  concatena as linhas da matriz em um array unidimensional:

In [30]:
## ravel -> passagem por referência
print('array reshape')
print(arr_reshape)

print('\n')
arr_ravel[4] = 12

arr_ravel = arr_reshape.ravel()
print('array ravel')
print(arr_ravel)


print('array reshape')
print(arr_reshape)

array reshape
[[ 0  1  2]
 [ 3 12  5]
 [ 6  7  8]]


array ravel
[ 0  1  2  3 12  5  6  7  8]
array reshape
[[ 0  1  2]
 [ 3 12  5]
 [ 6  7  8]]

In [28]:
# x = 2
# y = x
# x = 4

# ## isso pode acontecer de 2 jeitos
# ## 1o jeito é a passagem por cópia
# x = 2
# y = x = 2 ## Uma copia do valor de x na hora
# y = 2 # O valor de y é 2

# ## 2o jeito é a passagem pode ser por referencia
# x = 2
# y = x = 2 ## Neste caso o y não é uma copia de quanto valia x, ele é como um SEGUNDO NOME pro x
# x = 4
# y = x = 4

__Método flatten__: também concatena as linhas da matriz em um array unidimensional, porém, faz uma cópia dos elementos. O método ravel gera uma view, portanto se algum elemento for modificado, o array original também é modificado:

In [31]:
## Flatten -> Passagem por cópia
arr_flatten = arr_reshape.flatten()

arr_flatten[4] = 50

print('Array flatten')
print(arr_flatten)

print('\n')

print('Array Reshape')
print(arr_reshape)

Array flatten
[ 0  1  2  3 50  5  6  7  8]


Array Reshape
[[ 0  1  2]
 [ 3 12  5]
 [ 6  7  8]]

__Transposta de Matriz:__ Ao calcular a tranposta da Matriz, inverte os valores das linhas pelas colunas de cada uma das posições:

In [35]:
## Transposta
matriz = np.ones((5, 3))

print(matriz)
print("Dimensões: ", matriz.shape)
print('\n')

print('Transposta:')

matriz_T = matriz.T

print(matriz_T)
print("Dimensões: ", matriz_T.shape)

[[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]
Dimensões:  (5, 3)


Transposta:
[[1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]]
Dimensões:  (3, 5)

__Máscaras booleanas__ seguem valendo para matrizes:

In [38]:
## Máscara
array = np.arange(18).reshape(3,6)
print("Matriz: ")
print(array)

mascara = array > 9

print('Array filtrado')
print(array[mascara])

Matriz:
[[ 0  1  2  3  4  5]
 [ 6  7  8  9 10 11]
 [12 13 14 15 16 17]]
Array filtrado
[10 11 12 13 14 15 16 17]

## Exercício

1 - Faça um programa que peça para o usuário digitar o nome de um produto e seu preço, armazene esses dados em um array multidimensional. Em seguida, exiba esses dados na tela, de forma que a leitura fique facilitada.

In [47]:
tabela = []
nome_produto = ' '

while (nome_produto != ''):
    linha = []
    nome_produto = input('Digite o nome do produto, se quiser parar aperte enter: ')
    if(nome_produto != ''):
        preco_produto = float(input('Digite o preço do produto: '))
        linha.append(nome_produto)
        linha.append(preco_produto)
        tabela.append(linha)
        
matriz = np.array(tabela)
print('Tabela de preços\n')
print(matriz)

Digite o nome do produto, se quiser parar aperte enter: Tomate
Digite o preço do produto: 3.50
Digite o nome do produto, se quiser parar aperte enter: Agua
Digite o preço do produto: 3
Digite o nome do produto, se quiser parar aperte enter: Coca-cola
Digite o preço do produto: 9.40
Digite o nome do produto, se quiser parar aperte enter:
Tabela de preços

[['Tomate' '3.5']
 ['Agua' '3.0']
 ['Coca-cola' '9.4']]

2 - Usando o array criado no anterior, peça para o usuário digitar um indice de produto e retorne a linha correspondente do array com produtos e preços

In [50]:
indice = int(input('Digite qual produto quer consultar o preço: '))
print(matriz[indice])

Digite qual produto quer consultar o preço: 0
['Tomate' '3.5']

## Pandas

__Pandas__ é um pacote python construído com base no __NumPy__ e __Matplotlib__ que busca organizar dados no formato de tabela, atribuindo rótulos às linhas e colunas. O pacote __Pandas__ fornece ainda um conjunto de funcionalidades que permite processar as informações de tabelas de forma bastante eficiente, implementando métodos fundamentais para fins de tratamento de dados.

O Pandas organiza os dados nos seguintes tipos de estruturas:
- Series (Séries)
- DataFrame

 O __Pandas__ é um pacote e para utilizarmos, devemos importá-lo para o nosso notebook da seguinte forma:

In [51]:
# import da bibloteca do Pandas

import pandas as pd

##

### Series
A estrutura de representação tipo __Series__ do __Pandas__ é semelhante a um array unidimensional, porém os elementos podem ser indexados por números inteiros (como em um array do NumPy) ou por meio de rótulos (labels) que não precisam ser únicos e podem ser organizados de forma hierárquica.
- Quando os índices ou rótulos não são informados explicitamente, Pandas cria uma indexação com números inteiros automaticamente, variando os índices de $0$ (zero) a $n-1$, onde $n$ é o número de elementos na série.
- Os rótulos são usados para realizar buscas rápidas, alinhamento de dados e operações de junção de dados.

#### Criando séries com Pandas
Séries podem ser criadas no Pandas de diferentes formas, a partir de:
- Listas ou Arrays
- Dicionários
- DataFrames

### Utilizando Listas ou Arrays

In [56]:
# Vamos criar uma Serie a partir de uma lista do Python
lista = [12, 23, 34, 45, 56, 67, 78, 89]

# Define a Serie
series = pd.Series(data=lista)

# Mostra o resultado para a Serie criada
print(series)

0    12
1    23
2    34
3    45
4    56
5    67
6    78
7    89
dtype: int64

Agora vamos criar uma Serie a partir de um __np.array__:

In [55]:
# Vamos criar uma Serie a partir de uma lista do Python

# Cria um array usando a função np.array
array = np.arange(0, 50, 3)

# Cria a Serie a partir do array
serie_multiplos_3 = pd.Series(array)

# Mostra o resultado da Serie criada
serie_multiplos_3

0      0
1      3
2      6
3      9
4     12
5     15
6     18
7     21
8     24
9     27
10    30
11    33
12    36
13    39
14    42
15    45
16    48
dtype: int32

### Utilizando Dicionários

In [59]:
# Podemos criar Series a partir de Dicionarios tambem!

# Define o dicionario e seus elementos
dicionario = {'Tomate': 3.50, 'Agua' : 3, 'Coca-cola' : 9.40}

# Cria a Serie a partir dee um dicionário
serie_precos = pd.Series(dicionario)

# Mostra o resultado da Serie criada
print(serie_precos.index)
## O tipo de dado do indice é object -> Quer dizer que o pandas não sabe o que é
## Tipicamente é uma string

Index(['Tomate', 'Agua', 'Coca-cola'], dtype='object')

##

### Indexação

Assim como para os arrays, conseguimos acessar diversos elementos da __Serie__ a partir dos __índices:__

In [61]:
series

0    12
1    23
2    34
3    45
4    56
5    67
6    78
7    89
dtype: int64

In [62]:
# Plota o valor da serie na posição 3
series[3]

45

In [63]:
# Plota o valor da serie na posição 7
series[7]

89

In [64]:
# Cria um loop onde varre todos os elementos da Serie entre 0 e 8
for i in range(len(series)):
    print(series[i])

12
23
34
45
56
67
78
89

Da mesma forma, conseguimos fazer o __Slicing__ em uma __Serie__:

In [65]:
# Fatia a Serie até a posição 2
series[:2]

0    12
1    23
dtype: int64

In [66]:
# Fatia a Serie a partir da posição 4
series[4:]

4    56
5    67
6    78
7    89
dtype: int64

##

### Labels

Uma característica especial das __Series__ é que podemos escolher quais os __índices__ que queremos atribuir para cada um dos elementos e acessá-los a partir da __nova identifcação__ deles:

In [67]:
# Cria uma lista com os nomes dos indices/labels
labels = ['a', 'b', 'c', 'd', 'e']

# Cria a lista de elementos da Serie
numeros = [1, 2, 3, 4, 5]

# Cria a Serie passando os elementos dela e os indices
serie_explicita = pd.Series(data = numeros, index = labels)

# Plota o resultado para a Serie criada
serie_explicita

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [69]:
## Valor unico
serie_explicita['d']

4

In [72]:
##lista de valores
serie_explicita[['b', 'd', 'e']]

b    2
d    4
e    5
dtype: int64

In [ ]:
# Podemos igualmente acessar os nossos dados usando os novos indices
# trazer da Serie apenas os elementos que estão nos indices b e d

##

### Operações Matemáticas

De maneira análoga ao que fizemos usando os __arrays__, pode-se fazer qualquer tipo de manipulação matemática utilizando as __Series__:

In [74]:
## Adicionei um valor
serie_precos['Frango'] = 8.30

In [75]:
serie_precos

Tomate       3.5
Agua         3.0
Coca-cola    9.4
Frango       8.3
dtype: float64

In [76]:
# Podemos fazer manipulações matemáticas utilizando as Series
# Adicionando o valor 10 para cada elemento da Serie
serie_precos + 10

Tomate       13.5
Agua         13.0
Coca-cola    19.4
Frango       18.3
dtype: float64

In [77]:
# Dividindo cada elemento da Serie por 5
serie_precos / 5

Tomate       0.70
Agua         0.60
Coca-cola    1.88
Frango       1.66
dtype: float64

In [82]:
## Somando uma porcentagem
serie_precos * (1 + (10/100))

Tomate        3.85
Agua          3.30
Coca-cola    10.34
Frango        9.13
dtype: float64

In [83]:
# Divide o valor 300 por cada um dos elementos da Serie
300 / serie_precos

Tomate        85.714286
Agua         100.000000
Coca-cola     31.914894
Frango        36.144578
dtype: float64

In [84]:
serie_precos

Tomate       3.5
Agua         3.0
Coca-cola    9.4
Frango       8.3
dtype: float64

##

## Métodos Pandas

Justamente pela biblioteca __Pandas__ utilizando do NumPy para a construção da sua arquitetura, muito dos métodos que são nativos do NumPy também vão funcionar com o __Pandas__, além de alguns novos métodos que veremos a seguir:

In [85]:
# Vamos agora criar uma série e armazenar notas de alunos da Let's Code

# Cria Serie com valores de notas para cada aluno
notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])

# Mostra o resultado da Serie criada
notas

0     10.0
1      8.0
2      6.5
3      9.0
4      7.5
5      8.5
6      9.0
7      9.0
8      4.0
9      8.5
10     7.5
11     8.0
12    10.0
13    10.0
14     4.5
15     4.5
16     9.0
17     8.0
18     8.0
19     9.0
20     9.0
21     9.0
22     6.5
23     5.0
24     6.0
25     4.5
26     9.0
27    10.0
28     1.0
29     0.0
30     5.0
31     7.0
32     9.0
33     6.5
34     5.0
35     8.0
dtype: float64

__sort_values__: este método ordena a Serie de acordo com os valores númericos dos elementos:

In [86]:
notas.sort_values()

29     0.0
28     1.0
8      4.0
15     4.5
14     4.5
25     4.5
23     5.0
34     5.0
30     5.0
24     6.0
22     6.5
2      6.5
33     6.5
31     7.0
4      7.5
10     7.5
18     8.0
17     8.0
35     8.0
1      8.0
11     8.0
9      8.5
5      8.5
19     9.0
20     9.0
21     9.0
32     9.0
26     9.0
16     9.0
7      9.0
6      9.0
3      9.0
27    10.0
13    10.0
12    10.0
0     10.0
dtype: float64

In [90]:
# Ordenar as notas pelo valor delas:
notas.sort_values(ascending = False, inplace=True)# -> Se quiser editar direto na serie passo esse "inplace=True"

__unique:__ este método retorna todos os __valores distintos__ dentro de uma __Serie__:

In [92]:
notas.unique()

array([10. ,  9. ,  8.5,  8. ,  7.5,  7. ,  6.5,  6. ,  5. ,  4.5,  4. ,
        1. ,  0. ])

__nunique:__ este método retorna a quantidade de __valores distintos__ dentro de uma __Serie__:

In [93]:
notas.nunique()

13

__value_counts:__ este método retorna as __frequências (contagens)__ para cada um dos __elementos distintos__ dentro de uma Serie:

In [95]:
notas.value_counts()

9.0     9
8.0     5
10.0    4
6.5     3
5.0     3
4.5     3
8.5     2
7.5     2
7.0     1
6.0     1
4.0     1
1.0     1
0.0     1
dtype: int64

Podemos também ao invés de retorna as frequências, retornar as __proporções__ de cada um dos __elementos distintos__:

In [96]:
notas.value_counts(normalize=True)

9.0     0.250000
8.0     0.138889
10.0    0.111111
6.5     0.083333
5.0     0.083333
4.5     0.083333
8.5     0.055556
7.5     0.055556
7.0     0.027778
6.0     0.027778
4.0     0.027778
1.0     0.027778
0.0     0.027778
dtype: float64

In [97]:
notas.value_counts(normalize=True)*100

9.0     25.000000
8.0     13.888889
10.0    11.111111
6.5      8.333333
5.0      8.333333
4.5      8.333333
8.5      5.555556
7.5      5.555556
7.0      2.777778
6.0      2.777778
4.0      2.777778
1.0      2.777778
0.0      2.777778
dtype: float64

A seguir teremos alguns outros métodos já conhecidos do __NumPy__ que retorna algumas estatísticas básicas para a Serie:

In [98]:
# calcula a soma das notas
notas.sum()

259.0

In [99]:
# Retorna o maior valor da Serie
notas.max()

10.0

In [100]:
# Retorna o menor valor da Serie
notas.min()

0.0

In [101]:
# Calcula a media das notas da Serie
notas.mean()

7.194444444444445

In [102]:
# Calcula o Desvio padrão das notas
notas.std()

2.4327461783453628

In [103]:
# Calcula a mediana das notas das Series (termo central dos valores)
notas.median()

8.0

In [104]:
# Calcula a moda das notas (a nota mais frequente)
notas.mode()

0    9.0
dtype: float64

__describe:__ este é um método muito útil que vai trazer um resumos das __principais estátisticas__ da Serie que estamops trabalhando:

In [105]:
notas.describe()

count    36.000000
mean      7.194444
std       2.432746
min       0.000000
25%       5.750000
50%       8.000000
75%       9.000000
max      10.000000
dtype: float64

##

## Exercícios

**1)** Cria uma série de pandas que tenha os números inteiros de 0 a 100.

In [106]:
array = np.arange(0, 101)

serie = pd.Series(array)

print(serie)
print(type(serie))

0        0
1        1
2        2
3        3
4        4
      ...
96      96
97      97
98      98
99      99
100    100
Length: 101, dtype: int32
<class 'pandas.core.series.Series'>

**2)** Considere uma série de notas de alunos:
 
 notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])
                   
Determine:

**a)** A nota média

**b)** O desvio padrão

**c)** A moda

**d)** A mediana

In [107]:
 notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])
                   
#a
media = notas.mean()

#b
desvio = notas.std()

#c
moda = notas.mode()

#d
mediana = notas.median()

print('Media:', media)
print('Desvio:', desvio)
print('Moda:', moda)
print('Mediana:', mediana)

Media: 7.194444444444445
Desvio: 2.4327461783453628
Moda: 0    9.0
dtype: float64
Mediana: 8.0

## DataFrame

__DataFrames__ assim como na mesma analogia para as matrizes, são um __conjunto de Series__ que vão ser bem caracterizados pelo o seu formato tabular (o que facilita muito o processo de manipulação dos dados!):

In [112]:
# Cria um dicionario com nomes de alunos e suas respectivas notas
dictionary = {'Alunos': ['Sandro', 'Rafael', 'Tiago', 'André', 'Camila', 'Teo', 'Carlos', 'Juca', 'Carla'],
              'Notas': [8, 10, 9.5, 7.5, 9.5, 10, 5, 6.5, 10]}

# Cria um DataFrame a partir de um dicionario
df = pd.DataFrame(dictionary)

# Mostra o resultado do DataFrame
df

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

Todo o processo que vimos sobre __indexação__ e __métodos__  para as Series são válidas também quando trabalhamos com __DataFrames:__

In [113]:
# Retorna a coluna com os Nomes dos Alunos
df['Alunos']

0    Sandro
1    Rafael
2     Tiago
3     André
4    Camila
5       Teo
6    Carlos
7      Juca
8     Carla
Name: Alunos, dtype: object

In [114]:
# Retorna a coluna com as notas dos Alunos
df['Notas']

0     8.0
1    10.0
2     9.5
3     7.5
4     9.5
5    10.0
6     5.0
7     6.5
8    10.0
Name: Notas, dtype: float64

In [115]:
print(df.index)

RangeIndex(start=0, stop=9, step=1)

In [116]:
## Filtro pelo indice
df.index == 1

array([False,  True, False, False, False, False, False, False, False])

In [117]:
## Acessando com a máscara
df[df.index==1]

   Alunos  Notas
1  Rafael   10.0

In [119]:
# Calcula a média das notas dos alunos
df['Notas'] ## -> É uma serie
## Funcoes de series se aplicam
df['Notas'].mean()

8.444444444444445

In [123]:
# Retorna o nome do aluno localizado na posição 1
df['Alunos'][3]
df['Notas'][3]

7.5

In [129]:
## Linha de racionio
## 1 - Decide a mascara (filtro) Ex df['Alunos'] == 'Rafael'
## 2 - Acessei o dataframe na mascara Ex: df[mascara]
## 3 - Se eu quiser só uma coluna eu peço ela logo em seguida df[mascara][coluna]
## df[df['Alunos'] == 'Rafael']['Notas']

df[df['Notas'] > 6]['Alunos']

0    Sandro
1    Rafael
2     Tiago
3     André
4    Camila
5       Teo
7      Juca
8     Carla
Name: Alunos, dtype: object

__Método loc:__ Este é um método especial para quando queremos acessar os elementos de um DataFrame, onde podemos acessar utilizando apenas os índices ou mesmo passando duas posições específicas:

In [131]:
# Retorna com o loc os elementos da posição 2
print(type(df.loc[1]))

<class 'pandas.core.series.Series'>

In [135]:
# Podemos usar o loc pra pegar um elemento em particular
# importante: a ordem é [linha, coluna]
df.loc[1, 'Notas'] = 10

In [136]:
df

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

## Máscaras Booleanas

Podemos fazer filtros no __DataFrame__ definindo como que para os arrays, as __máscaras booleanas:__

In [137]:
# Chamando a coluna notas
df['Notas']

0     8.0
1    10.0
2     9.5
3     7.5
4     9.5
5    10.0
6     5.0
7     6.5
8    10.0
Name: Notas, dtype: float64

In [138]:
# Como o DataFrame é composto de varias Series, podemos utilizar-lo para fazer filtros
# Aplicando a mascara booleana a coluna notas
df['Notas'] > 9

0    False
1     True
2     True
3    False
4     True
5     True
6    False
7    False
8     True
Name: Notas, dtype: bool

In [139]:
# Retorna apenas os casos que satisfazem a condição
df[df['Notas'] > 9]

   Alunos  Notas
1  Rafael   10.0
2   Tiago    9.5
4  Camila    9.5
5     Teo   10.0
8   Carla   10.0

In [ ]:
# Outro exemplo de aplicação

## Exercícios

### Para o Dataframe de Alunos utilizado

**1)** Encontre a nota média dos alunos

In [141]:
df['Notas'].mean()

8.444444444444445

**2)** A nota do Juca

In [144]:
df[df['Alunos'] == 'Juca']['Notas']

7    6.5
Name: Notas, dtype: float64

**3)** Os alunos com nota menor que 6.5

In [146]:
df[df['Notas'] < 6.5]

   Alunos  Notas
6  Carlos    5.0

**4)** Peça a descrição das notas para ter insights interessantes

In [147]:
df.describe()

           Notas
count   9.000000
mean    8.444444
std     1.810463
min     5.000000
25%     7.500000
50%     9.500000
75%    10.000000
max    10.000000

**5)** A moda das notas acima de 7

In [154]:
df[df['Notas'] > 7]['Notas'].mode()

0    10.0
dtype: float64

##

##

## Trabalhando com CSVs

O __Pandas__ tem algumas funcionalidades bem interessantes, como por exemplo permitir que carregue para o Notebook arquivos no formato csv, excel, xlsx e etc. Vamos ver uma aplicação como o CSV:

In [155]:
# Carrega um arquivo CSV
df = pd.read_csv('../datasets/titanic.csv')
## .. -> Sobe de pasta
## /<nome_da_pasta> entra na pasta

# Print do DataFrame
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

[Neste Link](https://www.kaggle.com/c/titanic/data), conseguimos mais informações sobre a base de dados do Titanic! O Kaggle é uma plataforma muito conheciida no quesito de competições de Data Science e Machine Learning, além de disponibilizar diversos conjuntos de dados para treinarmos =)

Vamos testar alguns outros __métodos__ disponíveis para os DaataFrames:

In [156]:
# Mostra as dimensões da DataFrame
df.shape

(891, 12)

__Método head/tail:__ São métodos muito importantes que mostram na tela as primeiras e últimas linhas respectivamente de um __DataFrame__:

In [159]:
# Mostra as primeiras 5 linhas do DataFrame
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [162]:
# Mostra as ultimas 5 linhas do DataFrame
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [164]:
# Mostra a porcentagem de sobreviventes do Titanic
df['Survived'].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [165]:
# Mostra a Contagem de Sobreviventes no Titanic
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [166]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

##

## Exercícios

### Para o Dataframe do Titanic

**1)** Faça a leitura do Dataframe e mostre as 5 primeiras linhas

In [170]:
df = pd.read_csv('../datasets/titanic.csv')

In [171]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**2)** Calcule a tarifa média por Sexo

In [177]:
df[df['Sex'] == 'female']['Fare'].mean()

44.47981783439491

In [178]:
df[df['Sex'] == 'male']['Fare'].mean()

25.523893414211443

**3)** Determine o passageiro que pagou a maior tarifa

In [181]:
## df['Fare'].max() Também é dado que podemos usar em comparação
df[df['Fare'] == df['Fare'].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [189]:
df[['Name', 'Fare']].max()

Name    van Melkebeke, Mr. Philemon
Fare                       512.3292
dtype: object

**4)** Determine a idade média dos sobreviventes

In [185]:
df[df['Survived'] == 1]['Age'].mean()

28.343689655172415

In [186]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

__5)__ Determinem a classe com mais sobreviventes proporcionalmente

In [188]:
df[df['Survived'] == 1]['Pclass'].value_counts(normalize=True)

1    0.397661
3    0.347953
2    0.254386
Name: Pclass, dtype: float64

In [193]:
survived = df.Survived == 1
pclass = df.Pclass.value_counts()
pclass_survived = df[survived].Pclass.value_counts()
print(pclass)
print(pclass_survived)
pclass_survived.sort_index() / pclass.sort_index()

3    491
1    216
2    184
Name: Pclass, dtype: int64
1    136
3    119
2     87
Name: Pclass, dtype: int64

1    0.629630
2    0.472826
3    0.242363
Name: Pclass, dtype: float64

## Desafio

1 - Escolha um dataset do [Kaggle](https://www.kaggle.com/), explore seus dados e traga uma informação interessante que você encontrou. Esta prática é bastante importante para familizariação com a exploração de dataframes

## Links, Artigos e Referências:

- [Documentação do Pandas](https://pandas.pydata.org/docs/), documentação onde vocês podem encontrar mais informações sobre os métodos e funções do Pandas e descobrir novos métodos que não foram apresentados no curso;
- ["10 Python Pandas Tricks that make your work more efficient",](https://towardsdatascience.com/10-python-pandas-tricks-that-make-your-work-more-efficient-2e8e483808ba) artigo escrito pelo Towards Data Science;
- ["28 useful Pandas functions you might not know"](https://paulovasconcellos.com.br/28-useful-pandas-functions-you-might-not-know-de42c59db085https://medium.com/@zachary.bedell/writing-beautiful-code-with-numpy-505f3b353174), artigo escrito por Paulo Vasconcellos para o Data Hackers;